functions:
  - id: comment
    filter: "true"
    disabled: null
    conf:
      comment: Map Azure Graph Security Alerts data to the Detection Finding (2004)
        Class
  - id: serde
    filter: "true"
    disabled: null
    conf:
      mode: extract
      type: json
      srcField: _raw
  - id: eval
    filter: "true"
    disabled: null
    conf:
      add:
        - name: activity_id
          value: "status==='newAlert' ? 1 : status==='inProgress' ? 2 :
            status==='dismissed' || status==='resolved' ? 3:0"
        - disabled: false
          name: activity_name
          value: "status==='newAlert' ? 'Create' : status==='inProgress' ? 'Update' :
            status==='dismissed' || status==='resolved' ? 'Close':'Unknown'"
        - name: category_uid
          value: "2"
        - name: class_uid
          value: "2004"
        - disabled: false
          name: class_name
          value: "'Detection Finding'"
        - name: message
          value: description
        - name: is_alert
          value: status==='newAlert'
        - name: severity_id
          value: severity==='informational'?1:severity==='low'?2:severity==='medium'?3:severity==='high'?3:0
        - disabled: false
          name: severity
          value: severity==='informational'?'Informational':severity==='low'?'Low':severity==='medium'?'Medium':severity==='high'?'High':'Unknown'
        - name: status_id
          value: "status==='newAlert' ? 1 : status==='inProgress' ? 2 :
            status==='dismissed' ? 3 : status==='resolved' ? 4:0"
        - name: status_code
          value: "status==='newAlert' ? 'New' : status==='inProgress' ? 'In Progress' :
            status==='dismissed' ? 'Suppressed' : status==='resolved' ?
            'Resolved':'Unknown'"
        - name: status_detail
          value: feedback
        - name: time
          value: Date.parse(createdDateTime)/1000
        - name: type_uid
          value: 2004*100+activity_id
        - disabled: false
          name: type_name
          value: "type_uid === 200400 ? 'Detection Finding: Unknown' : type_uid === 200401
            ? 'Detection Finding: Create' : type_uid === 200402 ? 'Detection
            Finding: Update' : type_uid === 200403 ? 'Detection Finding: Close'
            : 'Detection Finding: Other'"
        - name: resources
          value: "[{uid:host,ip:{value:(userStates&&userStates.length?userStates[0].logon\
            Ip:null)},name:host}]"
        - name: observables
          value: "[{type_id:2,name:'userStates.logonIp',value:(userStates&&userStates.len\
            gth?userStates[0].logonIp:null)}]"
          disabled: true
        - name: timezone_offset
          value: "0"
      keep: []
      remove: []
    description: Set top-level OCSF fields
    groupId: PkQ3Qo
  - id: eval
    filter: "true"
    disabled: null
    conf:
      add:
        - disabled: false
          value: "[{type_id:2,name:'logonIp',value:(userStates&&userStates.length?userSta\
            tes[0].logonIp:null)},
            {type_id:4,name:'userPrincipalName',value:(userStates&&userStates.l\
            ength?userStates[0].userPrincipalName:null)}]"
          name: observables
    groupId: PkQ3Qo
    description: Set observables field
  - id: eval
    filter: "true"
    disabled: null
    conf:
      add:
        - name: finding_info
          value: "{}"
        - name: finding_info.analytic
          value: "{}"
        - name: finding_info.analytic.type_id
          value: "1"
        - name: finding_info.analytic.name
          value: "'Microsoft Graph API Security Alert'"
        - name: finding_info.analytic.uid
          value: id
        - name: finding_info.uid
          value: id
        - name: finding_info.title
          value: title
    description: Set finding_info field
    groupId: PkQ3Qo
  - id: eval
    filter: "true"
    disabled: null
    conf:
      add:
        - name: metadata
          value: "{}"
        - name: metadata.product
          value: "{}"
        - name: metadata.product.vendor_name
          value: "'Microsoft'"
        - name: metadata.product.name
          value: "'Azure Sentinel'"
        - name: metadata.product.uid
          value: vendorInformation.vendor
        - name: metadata.product.version
          value: vendorInformation.providerVersion
        - name: metadata.version
          value: "'1.4.0-detection_finding-2004'"
        - name: metadata.log_name
          value: source
        - name: metadata.tenant_uid
          value: azureTenantId
    description: Set metadata field
    groupId: PkQ3Qo
  - id: eval
    filter: "true"
    disabled: null
    conf:
      add:
        - disabled: false
          name: unmapped
          value: "{}"
        - disabled: false
          name: unmapped. azureTenantId
          value: azureTenantId
        - disabled: false
          name: unmapped.provider
          value: vendorInformation.provider
        - disabled: false
          name: unmapped.category
          value: category
        - disabled: false
          name: unmapped.description
          value: description
    description: Set unmapped field
    groupId: PkQ3Qo
  - id: eval
    filter: "true"
    disabled: null
    conf:
      keep:
        - unmapped.*
        - message
        - finding_info.*
        - status_detail
        - status_code
        - time
        - status_id
        - resources.*
        - observables.*
        - confidence_id
        - timezone_offset
        - is_alert
        - device.*
        - severity_id
        - evidences.*
        - metadata.*
        - category_*
        - class_*
        - type_*
        - activity_*
        - severity
      remove:
        - "*"
        - _*
    description: Drop non-OCSF fields
streamtags:
  - cpe
groups:
  PkQ3Qo:
    name: Set OCSF Detection Finding fields
    index: 2
